Revit 2027 API
BuiltInFailures.SplitToposolidFailures Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SplitToposolidFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SplitToposolidFailures
Public NotInheritable Class SplitToposolidFailures
public ref class SplitToposolidFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SplitToposolidFailures = class end
The BuiltInFailures.SplitToposolidFailures type exposes the following members.
Properties
Name | Description
GenerateNewSplitTopoFailed |  Failed to generate new toposolid after split.
SplitToposolidFailed |  Split toposolid failed.
Top
See Also
Reference
Autodesk.Revit.DB Namespace